Revit 2027 API
Rebar.FreeFormMorphedServerGuid Property
 Guid used for identifying the external IRebarUpdateServer for computing Morphed Free Form Rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static Guid FreeFormMorphedServerGuid { get; }
Public Shared ReadOnly Property FreeFormMorphedServerGuid As Guid
	Get
public:
static property Guid FreeFormMorphedServerGuid {
	Guid get ();
}
static member FreeFormMorphedServerGuid : Guid with get
Property Value
Guid
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace